Revit 2027 API
RoofComponents.GetLoopFaces Method
 The faces of the loops of roof slabs.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Face> GetLoopFaces()
Public Function GetLoopFaces As IList(Of Face)
public:
IList<Face^>^ GetLoopFaces()
member GetLoopFaces : unit -> IList<Face>
Return Value
IList<Face>
 The faces.
See Also
Reference
RoofComponents Class
Autodesk.Revit.DB.IFC Namespace